Updates and added tests
